{
  "week": 10,
  "season": "2025",
  "leagueId": "1182940167115010048",
  "persona": "Pat McAfee",
  "summary": "LADIES AND GENTLEMEN, WELCOME TO THE ABSOLUTE CHAOS THAT WAS WEEK 10 OF FANTASY FOOTBALL! HOLY MOLY, what a weekend we just witnessed! The \"Prince of Pizza Pies\" PrinceofPizza just DROPPED THE HAMMER with a MASSIVE 17-point BANGER, the highest score of the week! Meanwhile, we had FIVE teams put up straight ZEROES! ZEROES, PEOPLE! That's not a typo, that's not a glitch in the matrix, that's just fantasy football being the beautiful DISASTER that it is! The average score was 4.02 points, which means most of you were basically starting your third-string long snapper at running back! LETS GOOOOO!\n\nNow let's talk about the matchups, shall we? \"The Drob Squad\" drobs DOMINATED TophTT by 8.6 points in what was technically the biggest blowout of the week – and brother, when 8.6 points is your BIGGEST MARGIN, you know it's been a defensive SLUGFEST! \"The Mastermind\" mastab24 squeaked past cosmohouck by 3.82 in what I'm calling a mid-tier barn burner! But the MAIN EVENT, the CHAMPIONSHIP BOUT, was PrinceofPizza absolutely BODYSLAMMING Shogunation by 8.10 points! That's what we call a STATEMENT WIN, FOR THE BRAND! Meanwhile, Langland beat mjgrana by 0.9 points in what was essentially a field goal difference!\n\nBut HOLD ON A SECOND, we need to talk about powerperson, aka \"The Power Outage!\" My guy, MY GUY! What in the WORLD happened to your lineup decisions?! You've got FIVE – COUNT 'EM, F-I-V-E – spots in the worst lineup decisions of the week! The data says \"[object Object]\" but what it SHOULD say is \"CATASTROPHIC FAILURE!\" You left points on the bench like you were collecting Pokemon cards! This is the kind of performance that gets you on NOT TOP 10! I don't even know what you started or benched because the fantasy gods have REDACTED your mistakes to protect your identity, but buddy, everyone already knows it was you! That's like showing up to a football game wearing ice skates!\n\nHere's my BOLD PREDICTION for next week: PrinceofPizza is about to go on an ABSOLUTE HEATER and I'm calling it right now – we got ourselves a RIVALRY BREWING between PrinceofPizza and drobs! Both took care of business this week, both are riding high, and you KNOW they're gonna run into each other down the stretch! As for the rest of you scoring zeroes, I need you to check if your players are actually ALIVE and on NFL rosters! And to wrap this thing up with a bow: Week 10 was so low-scoring, even the PUNTERS are laughing at us! FOR THE BRAND! BOOM! *flips table*",
  "generatedAt": "2025-11-07T04:40:34.893Z"
}