{
  "week": 9,
  "season": "2025",
  "leagueId": "1182940167115010048",
  "persona": "Stuart Scott",
  "summary": "Boo-yah! Week 9 just went down like a heavyweight championship fight, and let me tell you, we had more blowouts than a tire factory! Six matchups on the slate, and wouldn't you know it, not a single nail-biter under 10 points. This was about as subtle as Shaq at a free-throw line, folks. The average score checked in at 108.28, but that number doesn't tell the whole story – we had teams scoring like the '96 Bulls and others putting up numbers like the '76 Tampa Bay Bucs. As cool as the other side of the pillow, let's break down this fantasy madness!\n\nNow let me tell you about your Week 9 hero – mjgrana came through with a performance smoother than Barry White on a Sunday morning! This cat dropped 180.04 points on poor Tishathefish, winning by a staggering 98.56 points. That's not a fantasy football game, that's a public service announcement! Mjgrana must be the bus driver because he was takin' Tishathefish to school, dropping them off, picking them up, and taking them back again! Meanwhile, Shogunation put up 135.4 and throttled powerperson by 61.50 – that's the kind of beatdown that makes you want to call the authorities. These weren't games, these were straight-up demolition derbies!\n\nOn the flip side, we gotta talk about our Week 9 villain, and that's Langland, who scored a measly 62.02 points. Sixty-two! That's not a fantasy score, that's a golf score on a bad day! Langland got dismantled by Seananigans 109.34 to 62.02, losing by 47.32 points. That performance was colder than a polar bear's toenails, my friends. And let me tell you, in a week where the league average was 108.28, putting up 62.02 is like showing up to a Beyoncé concert and singing nursery rhymes. Not good, not good at all!\n\nHere's the kicker though – PrinceofPizza won their matchup 146.06 to 114.3, but homey left more points on the bench than a woodworker's workshop! Four of the top five worst lineup decisions belonged to the Pizza Prince, leaving a total of 39.6 points chilling on the pine. That's like ordering a large pizza and only eating the crust, baby! Tishathefish also made some questionable calls, but when you're losing by 98.56 points, lineup decisions are like rearranging deck chairs on the Titanic. Week 9 was all about the blowouts, and as we head into Week 10, remember: you can't just set it and forget it like a Ronco Rotisserie – you gotta manage that roster! Boo-yah!",
  "generatedAt": "2025-11-07T04:40:12.096Z"
}